РасчетныеЗадачиЗанятие2/src/Documents/ПриказОбУвольнении/ПриказОбУвольнении.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриказОбУвольнении</name>
  <basedOn>Document.ПриказОПриеме</basedOn>
  <registerRecords>InformationRegister.СостояниеСотрудников</registerRecords>
  <attributes>
    <name>ПриказОПриеме</name>
    <type>
      <types>DocumentRef.ПриказОПриеме</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Document>

РасчетныеЗадачиЗанятие2/src/Documents/ПриказОбУвольнении/ObjectModule.bsl
Процедура ОбработкаЗаполнения(Основание)
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПриказОПриеме") Тогда
		ФизическоеЛицо = Основание.ФизическоеЛицо;
		Подразделение = Основание.Подразделение;
		Должность = Основание.Должность;
		ПриказОПриеме = Основание;
	КонецЕсли;
КонецПроцедуры
